Revit 2026 API

# ExporterIFCSetMaterialIdForCurrentExportState Method

---

This sets the material id that is to be associated with the element in the current export state.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetMaterialIdForCurrentExportState(
	ElementId elementId
)
```
```vb
Public Sub SetMaterialIdForCurrentExportState (
	elementId As ElementId
)
```
```cpp
public:
void SetMaterialIdForCurrentExportState(
	ElementId^ elementId
)
```
```fsharp
member SetMaterialIdForCurrentExportState :
        elementId : ElementId -> unit
```

#### Parameters

elementId ElementId
     The material id.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Even though there could be several materials associated with the element (set during PushExportState()), unless the element has support for IfcMaterialLayerSet, IFC output will include only this one.

#### Reference

ExporterIFC Class

Autodesk.Revit.DB.IFC Namespace